Repository: BahramElf/comment-generator-free-wordpress-plugin
Catalog: languages/comment-generator-*.po
Languages: fa_ir

source: Comment Generator Pro
fa_ir: کامنت گذار حرفه‌ای وردپرس و ووکامرس

source: Comment Generator
fa_ir: کامنت ساز حرفه‌ای

source: Settings
fa_ir: تنظیمات

source: Comment Generation Settings
fa_ir: تنظیمات کامنت ساز

source: Comment Mode
fa_ir: نوع ساخت دیدگاه

source: Specific post id
fa_ir: ID پست

source: Post Type
fa_ir: نوع پست

source: Category
fa_ir: دسته بندی

source: Number of Posts
fa_ir: تعداد پست

source: Number of Comments
fa_ir: تعداد دیدگاه

source: Date of Comments from
fa_ir: تاریخ ایجاد دیدگاه از

source: Product review rating
fa_ir: امتیاز دیدگاه برای محصول

source: Product stock status
fa_ir: وضعیت موجودی محصول

source: Comment status
fa_ir: وضعیت دیدگاه

source: Comment from
fa_ir: دیدگاه از طرف

source: General Comment Sentences
fa_ir: جملات دیدگاه‌ عمومی

source: General product buyer Sentences
fa_ir: جملات دیدگاه‌ خریداران تایید شده برای محصول

source: General product none buyer Sentences
fa_ir: جملات دیدگاه‌ کاربر(غیر خریدار) برای محصول

source: Custom Comment Authors
fa_ir: نویسنده‌گان دیدگاه‌

source: Delete Commented Items
fa_ir: حذف لیست پست‌های کامنت گذاری شده

source: Please specify the number of comments and posts according to your hosting and server resources.
fa_ir: لطفا تعداد نظرات و پست‌ها را با توجه به منابع هاست و سرور خود مشخص کنید.

source: If you intend to create a large number of comments, consider doing it in batches.
fa_ir: اگر قصد دارید تعداد زیادی نظر ایجاد کنید، این کار را به صورت بخش بندی شده انجام دهید.

source: Otherwise, you may encounter temporary server resource errors or the website may become temporarily unavailable.
fa_ir: در غیر این صورت، ممکن است در زمان ایجاد دیدگاه‌ها با خطاهایی مثل ارور 500 مواجه شوید یا سایت شما به طور موقت در دسترس خارج شود.

source: We suggest creating 200 to 400 comments in each batch.
fa_ir: پیشنهاد ما ساخت ۲۰۰ تا ۴۰۰ کامنت در هر مرحله است. (کاملا به هاست شما بستگی دارد.)

source: Single Post
fa_ir: پست تکی

source: Select PostType
fa_ir: انتخاب نوع پست

source: It is important to choose the correct post type, both in individual commenting mode and in group commenting mode.
fa_ir: انتخاب نوع پست صحیح، چه در حالت ثبت دیدگاه روی پست تکی و چه در حالت دسته بندی ضروری است.

source: Select Category
fa_ir: انتخاب دسته بندی

source: You can use plugins like "Reveal IDs" or "Catch IDs" to find and view the ID of a pages, articles, products, etc.
fa_ir: برای پیدا کردن ID پست، صفحه، محصولات و غیره می‌توانید از افزونه‌هایی مانند "Reveal IDs" یا "Catch IDs" استفاده کنید.

source: Month ago
fa_ir: ماه قبل

source: 3 and above (out of 5 stars)
fa_ir: ۳ و بیشتر (از ۵ ستاره)

source: 4 and above (out of 5 stars)
fa_ir: ۴ و بیشتر (از ۵ستاره)

source: Approved
fa_ir: تایید شده

source: Pending
fa_ir: در انتظار بررسی

source: Buyer
fa_ir: خریدار

source: User
fa_ir: کاربر

source: Random
fa_ir: تصادفی

source: In stock
fa_ir: موجود

source: Out of stock
fa_ir: ناموجود

source: General Comments, Enter one sentence per line
fa_ir: دیدگاه‌های عمومی، هر جمله در یک خط

source: Comments from buyers of products, Enter one sentence per line
fa_ir: دیدگاه‌های خریداران تایید شده برای محصول

source: Products general comments from regular users (Non buyers),Enter one sentence per line
fa_ir: دیدگاه‌های سایر کاربران برای محصول

source: Add one author per line in the format "Author Name|author@example.com".
fa_ir: نویسنده دیدگاه، هر خط یک نویسنده به صورت "نام نویسنده|author@example.com". ایمیل اجباری نیست.

source: If a comment is made on a post or product, the plugin saves its ID, so as to avoid creating consecutive comments on a post in a segmented implementation.
fa_ir: اگر نظری برای یک پست یا محصول ایجاد شود، افزونه ID آن را ذخیره می‌کند تا از ایجاد نظر به صورت متوالی روی یک پست جلوگیری شود.

source: You can delete the list of saved IDs by pressing the button below.
fa_ir: با زدن دکمه "حذف لیست کامنتگذاری شده"، لیست ID های ذخیره شده در حافظه پاک می‌شود.

source: This will not delete any comments.
fa_ir: اینکار هیچ پست یا دیدگاهی را حذف نمی‌کند.

source: Delete Commented Posts
fa_ir: حذف لیست کامنتگذاری شده

source: Commented items deleted successfully.
fa_ir: لیست پست‌های کامنتگذاری شده با موفقیت حذف شد.

source: Failed to delete commented items. Please try again.
fa_ir: خطا در زمان حذف لیست پست‌های کامنتگذاری شده. مجدد امتحان کنید.

source: Comment generation started.
fa_ir: ایجاد دیدگاه شروع شد...

source: Comments generated Report! \n New comment created: %d \n New commented posts: %d \n Duplicate posts that were already commented: %d \n If this is not your desired output, change the number of posts in the settings or use "Delete Commented Posts" button.
fa_ir: گزارش کامنت‌های ایجاد شده! کامنت ایجاد شده: %d پست‌های کامنت گذاری شده: %d پست‌های تکراری که قبلاً نظر داده شده‌اند: %d اگر این خروجی مطلوب شما نیست، تعداد پست‌ها را در تنظیمات تغییر دهید یا از دکمه 'حذف پست‌های نظر داده شده' استفاده کنید.

source: No Comments generated! Check the input values and settings.
fa_ir: کامنتی ایجاد نشد! مقادیر ورودی و تنظیمات را بررسی کنید.

source: After each change in the settings or entered information, first click the save changes button and then start creating comments.
fa_ir: بعد از هر تغییر در تنظیمات افزونه یا اطلاعات وارد شده، اول دکمه ذخیره تغییرات را بزنید و سپس شروع به ایجاد دیدگاه کنید.

source: Start Generating Comments
fa_ir: شروع ایجاد دیدگاه

source: Please enter at least one Sentence and one Author for comments.
fa_ir: لطفا حداقل یک جمله و یک نویسنده را برای نظرات وارد کنید.

source: Please enter at least one Buyer Sentence, one none Buyer Sentenceone and Author for comments.
fa_ir: لطفاً حداقل یک جمله از طرف خریدار تایید شده، یکی از طرف کاربر بازدید کننده و یک نویسنده برای نظرات وارد کنید.

source: Please enter at least one Buyer Sentence and Author for comments.
fa_ir: لطفا حداقل یک جمله از طرف خریدار تایید شده و یک نویسنده را برای نظرات وارد کنید.

source: Please enter at least one none Buyer Sentenceone and Author for comments.
fa_ir: لطفاً حداقل یک جمله از طرف کاربر بازدید کننده و یک نویسنده برای نظرات وارد کنید.

source: your server curl has problem, return code:%s, please ticket to host to fix curl problem for url %s
fa_ir: curl سرور شما مشکل دارد، کد بازگشتی:%s، لطفاً برای رفع مشکل curl آدرس %s به هاست خود تیکت بزنید.

source: A powerful plugin for creating comments on all kinds of posts, pages and products in WordPress and WooCommerce with professional settings for inserting comments in different modes. All rights of this plugin belongs to WPEX.ir
fa_ir: افزونه‌ قدرتمند ساخت کامنت با پشتیبانی از انواع پست‌ها، صفحات و محصولات در وردپرس و ووکامرس همراه با پنل تنظیمات حرفه‌ای برای درج کامنت در حالت‌های مختلف. تمامی حقوق این افزونه متعلق به WPEX.ir می‌باشد.
